trade_exp/src/DataProcessors/РабочееМестоОператораКПП/РабочееМестоОператораКПП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>РабочееМестоОператораКПП</name>
</mdclass:DataProcessor>

trade_exp/src/InformationRegisters/ИсторияДоступа/ИсторияДоступа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="32cac9b3-ae6b-4910-a190-eb09b563dd2e">
  <name>ИсторияДоступа</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="f854b50d-b2a2-49f4-9700-7fb74d83073a">
    <name>Событие</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <attributes extendedConfigurationObject="a6407727-3992-4e5a-b790-d60c98a8142f">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="9952a41b-07b8-481a-a255-fb5b95356519">
    <name>ТребуетсяПодтверждение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="fd2a6ea3-7fd0-47b6-b679-c23b2da25507">
    <name>ФИО</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="2c650d20-0b87-4501-af70-8003f8aec615">
    <name>ЦельПосещения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e0d0b80b-72a0-4188-8a76-a512cfcb3b5c">
    <name>ТипСканераКПП</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="cac5493c-805c-4ac9-bf52-13fdeb63d4fb">
    <name>РезультатСканированияКПП</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions extendedConfigurationObject="fff676fd-7266-4f3d-aa5f-01692611efcb">
    <name>ДатаСобытия</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="51660afc-e03f-4efd-b192-27ff9ed7be7e">
    <name>ЗонаДоступа</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="f7fba3d7-17e4-4fb7-9502-2fbc431f94c2">
    <name>Датчик</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="1fa77aff-d589-4a53-9548-7872c980796e">
    <name>Объект</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/Enums/СобытиеСКУД/СобытиеСКУД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="35d2c9e5-e6ef-4caf-ab80-71f525e7affa">
  <name>СобытиеСКУД</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="af31e311-ca12-4e8d-9849-5bf05539245c">
    <name>Вход</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="efba0129-c70c-4083-94eb-d252d37d7c10">
    <name>Выход</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="0de3725f-b285-48a8-b563-9b3b6a56746a">
    <name>Отказ</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/DataProcessors/РабочееМестоОператораКПП/Forms/ФормаПодтверждениеНаКПП/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Если Параметры.Документ <> Неопределено Тогда
		Документ = Параметры.Документ;
		Пропуск = Документ;
		Автор = Документ.Автор;
		Если ТипЗнч(Параметры.Документ) = Тип("ДокументСсылка.Пропуск")Тогда
			ЦельПосещения = Документ.ЦельПосещения;
			Расшифровка = Документ.Расшифровка;
			ФИО = Документ.ФИО;
			ВидТранспортногоСредства = Документ.ВидТранспортногоСредства;
			НаименованиеОрганизации = Документ.НаименованиеОрганизации;
			Комментарий = Документ.Комментарий;
		КонецЕсли;		
	КонецЕсли;
	Датчик = Параметры.Датчик;
	ДатаСобытия = Параметры.ДатаСобытия;  
	
КонецПроцедуры

&НаКлиенте
Процедура Подтвердить(Команда)

	ОбработатьПодтверждение(ПредопределенноеЗначение("Перечисление.СобытиеСКУД.Вход")); 
	Закрыть();

КонецПроцедуры

&НаКлиенте
Процедура Отклонить(Команда)
	
	Элементы.Причина.Видимость = Истина;
	Если НЕ ЗначениеЗаполнено(Причина) Тогда
		Сообщить("Укажите причину");
		Возврат;
	КонецЕсли;
	
	ОбработатьПодтверждение(ПредопределенноеЗначение("Перечисление.СобытиеСКУД.Отказ"));
	Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьПодтверждение(Событие)
	УстановитьПривилегированныйРежим(Истина);	
	НаборЗаписей = РегистрыСведений.ИсторияДоступа.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Объект.Установить(Пропуск);
	НаборЗаписей.Отбор.Датчик.Установить(Датчик);
	НаборЗаписей.Отбор.ДатаСобытия.Установить(ДатаСобытия);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Запись.Событие = Событие;
		Запись.Причина = Причина;
		Запись.ТребуетсяПодтверждение = Ложь; 
	КонецЦикла;
	НаборЗаписей.Записать(Истина);
		
КонецПроцедуры
